# Functions

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("mycsvfile.csv")

In [3]:
# obtaining the length of dataframe
len(df)

13

In [4]:
df

       Name  age classs grade gender
0    shivam    3   12th     a      f
1     rohit    2    8th     b      m
2    chetan   12    6th     c      m
3   asshish   32    9th     b      m
4     mohit   12   10th     d      m
5   asshmit   12    4th     e      m
6     tahsu    1   12th     a      f
7     priya   23    5th     b      f
8    sweety    4    7th     d      f
9    cheery   35    9th     b      f
10   candy    65    4th     e      f
11    chiku    4    8th     c      m
12    mohit   67    4th     f      m

In [5]:
# obtaining the highest age in the dataframe
max(df)

'grade'

In [6]:
# Obtaining the highest index of the dataframe
max(df.index)

12

In [7]:
# Obtaining the lowest index of the datatype
min(df.index)

0

In [8]:
# Obtaining the Datatype
type(df)

pandas.core.frame.DataFrame

In [9]:
# rounding the values of the dataframe
round(df, 2)

       Name  age classs grade gender
0    shivam    3   12th     a      f
1     rohit    2    8th     b      m
2    chetan   12    6th     c      m
3   asshish   32    9th     b      m
4     mohit   12   10th     d      m
5   asshmit   12    4th     e      m
6     tahsu    1   12th     a      f
7     priya   23    5th     b      f
8    sweety    4    7th     d      f
9    cheery   35    9th     b      f
10   candy    65    4th     e      f
11    chiku    4    8th     c      m
12    mohit   67    4th     f      m